README.org
#+STARTUP: indent nolineimages nofold
#+OPTIONS: ^:{}

* TeamGradings
procedures for team gradings

** help
#+begin_src bash
Commands:
  team_grading count           # count members in Group.list
  team_grading final           # mk final scores
  team_grading group           # edit group list
  team_grading help [COMMAND]  # Describe available commands or one specific command
  team_grading initial         # setup initial files on the upstream
  team_grading list            # list group name
  team_grading report          # score report
  team_grading speaker         # score speakers
  team_grading upload          # upload tables
#+end_src


* FILES
初期ファイルとして，
#+begin_src bash
./.team_gradings
./Group.list
./Report.tsv
./Speaker.list
#+end_src

* team gradingの仕方

** initial
1) 科目の名前(hikiのfile名)を./.team_gradingsに置く
2) Group.listを作成

** 日常手順
1) team_grading report
2) team_grading speaker
3) team_grading upload
4) hiki sync

** final score
1) 個人成績をfinal_exam.csvに記録(no, score\n, ...)
2) team_grading final
   1. final_greoup_results.csv:bonusを追加して，group成績を確定．uploadに回す
   2. personal_results.csv:個人成績とgroup成績とgroup最終成績を出力
3) luna sheetに登録
4) upload

** Installation

Add this line to your application's Gemfile:

#+begin_src ruby
gem 'team_gradings'
#+end_src

And then execute: =$ bundle=

Or install it yourself as: =$ gem install team_gradings=

